---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DebugtabDataboundcontrolsdemoInteger
source: html/3f08eefc-5cb4-69b4-4ae8-dddd5705f5c9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DebugtabDataboundcontrolsdemoInteger Property

"Integer"

## Syntax (C#)
```csharp
public static ForgeTypeId DebugtabDataboundcontrolsdemoInteger { get; }
```